{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "bottom" : "inputnode__0",
      "alpha" : 0.0039215669967234135,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "MobileNetV3_Seg\/truediv:0",
      "top" : "MobileNetV3_Seg\/truediv:0",
      "type" : "elementwise",
      "name" : "MobileNetV3_Seg\/truediv:0",
      "beta" : 0
    },
    {
      "bottom" : "",
      "k" : 3,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "negated_MobileNetV3_Seg\/rgb_mean:0_MobileNetV3_Seg\/sub:0",
      "constant_blob" : 1,
      "top" : "negated_MobileNetV3_Seg\/rgb_mean:0_MobileNetV3_Seg\/sub:0",
      "w" : 1,
      "type" : "load_constant",
      "name" : "negated_MobileNetV3_Seg\/rgb_mean:0_MobileNetV3_Seg\/sub:0"
    },
    {
      "bottom" : "MobileNetV3_Seg\/truediv:0,negated_MobileNetV3_Seg\/rgb_mean:0_MobileNetV3_Seg\/sub:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "MobileNetV3_Seg\/sub:0",
      "top" : "MobileNetV3_Seg\/sub:0",
      "type" : "elementwise",
      "name" : "MobileNetV3_Seg\/sub:0",
      "beta" : 0
    },
    {
      "bottom" : "",
      "k" : 3,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "inversed_MobileNetV3_Seg\/rgb_std:0_MobileNetV3_Seg\/truediv_1:0",
      "constant_blob" : 3,
      "top" : "inversed_MobileNetV3_Seg\/rgb_std:0_MobileNetV3_Seg\/truediv_1:0",
      "w" : 1,
      "type" : "load_constant",
      "name" : "inversed_MobileNetV3_Seg\/rgb_std:0_MobileNetV3_Seg\/truediv_1:0"
    },
    {
      "bottom" : "MobileNetV3_Seg\/sub:0,inversed_MobileNetV3_Seg\/rgb_std:0_MobileNetV3_Seg\/truediv_1:0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "MobileNetV3_Seg\/truediv_1:0",
      "top" : "MobileNetV3_Seg\/truediv_1:0",
      "type" : "elementwise",
      "name" : "MobileNetV3_Seg\/truediv_1:0",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/conv1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "MobileNetV3_Seg\/conv1\/Relu:0",
      "blob_weights" : 7,
      "K" : 3,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "MobileNetV3_Seg\/conv1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "MobileNetV3_Seg\/truediv_1:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/conv1_2\/primary_conv1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/conv1_2\/primary_conv1\/Relu:0",
      "blob_weights" : 11,
      "K" : 16,
      "blob_biases" : 9,
      "name" : "MobileNetV3_Seg\/conv1_2\/primary_conv1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "MobileNetV3_Seg\/conv1\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/conv1_2\/cheap_operation1\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/conv1_2\/cheap_operation1\/Relu:0",
      "blob_weights" : 15,
      "K" : 8,
      "blob_biases" : 13,
      "name" : "MobileNetV3_Seg\/conv1_2\/cheap_operation1\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "MobileNetV3_Seg\/conv1_2\/primary_conv1\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/conv1_2\/concat:0",
      "top" : "MobileNetV3_Seg\/conv1_2\/concat:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/conv1_2\/concat:0",
      "bottom" : "MobileNetV3_Seg\/conv1_2\/primary_conv1\/Relu:0,MobileNetV3_Seg\/conv1_2\/cheap_operation1\/Relu:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/conv1_2\/primary_conv2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/conv1_2\/primary_conv2\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 19,
      "K" : 16,
      "blob_biases" : 17,
      "name" : "MobileNetV3_Seg\/conv1_2\/primary_conv2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "MobileNetV3_Seg\/conv1_2\/concat:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/conv1_2\/cheap_operation2\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/conv1_2\/cheap_operation2\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 23,
      "K" : 8,
      "blob_biases" : 21,
      "name" : "MobileNetV3_Seg\/conv1_2\/cheap_operation2\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "MobileNetV3_Seg\/conv1_2\/primary_conv2\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/conv1_2\/concat_1:0",
      "top" : "MobileNetV3_Seg\/conv1_2\/concat_1:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/conv1_2\/concat_1:0",
      "bottom" : "MobileNetV3_Seg\/conv1_2\/primary_conv2\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/conv1_2\/cheap_operation2\/BatchNorm\/FusedBatchNorm:0"
    },
    {
      "bottom" : "MobileNetV3_Seg\/conv1_2\/concat_1:0,MobileNetV3_Seg\/conv1\/Relu:0",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "MobileNetV3_Seg\/conv1_2\/add:0",
      "top" : "MobileNetV3_Seg\/conv1_2\/add:0",
      "type" : "elementwise",
      "name" : "MobileNetV3_Seg\/conv1_2\/add:0",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/trans3branch_0_1\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "MobileNetV3_Seg\/trans3branch_0_1\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 27,
      "K" : 16,
      "blob_biases" : 25,
      "stride_x" : 2,
      "name" : "MobileNetV3_Seg\/trans3branch_0_1\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "MobileNetV3_Seg\/conv1_2\/add:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/stage2\/depthwise_conv\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "MobileNetV3_Seg\/stage2\/depthwise_conv\/Relu:0",
      "blob_weights" : 31,
      "K" : 16,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "MobileNetV3_Seg\/stage2\/depthwise_conv\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "MobileNetV3_Seg\/conv1_2\/add:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/stage2\/proj\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/stage2\/proj\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 35,
      "K" : 16,
      "blob_biases" : 33,
      "name" : "MobileNetV3_Seg\/stage2\/proj\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "MobileNetV3_Seg\/stage2\/depthwise_conv\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/pt0\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/pt0\/Relu:0",
      "blob_weights" : 39,
      "K" : 16,
      "blob_biases" : 37,
      "name" : "MobileNetV3_Seg\/encodeHard2\/pt0\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "MobileNetV3_Seg\/stage2\/proj\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/dw0\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/dw0\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 43,
      "K" : 12,
      "blob_biases" : 41,
      "name" : "MobileNetV3_Seg\/encodeHard2\/dw0\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 12,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/pt0\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/concat:0",
      "top" : "MobileNetV3_Seg\/encodeHard2\/concat:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard2\/concat:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/dw0\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/stage2\/proj\/BatchNorm\/FusedBatchNorm:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/pt1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/pt1\/Relu:0",
      "blob_weights" : 47,
      "K" : 28,
      "blob_biases" : 45,
      "name" : "MobileNetV3_Seg\/encodeHard2\/pt1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/concat:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/dw1\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/dw1\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 51,
      "K" : 20,
      "blob_biases" : 49,
      "name" : "MobileNetV3_Seg\/encodeHard2\/dw1\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 20,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/pt1\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/pt2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/pt2\/Relu:0",
      "blob_weights" : 55,
      "K" : 20,
      "blob_biases" : 53,
      "name" : "MobileNetV3_Seg\/encodeHard2\/pt2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/dw1\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/dw2\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/dw2\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 59,
      "K" : 12,
      "blob_biases" : 57,
      "name" : "MobileNetV3_Seg\/encodeHard2\/dw2\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 12,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/pt2\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/concat_1:0",
      "top" : "MobileNetV3_Seg\/encodeHard2\/concat_1:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard2\/concat_1:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/dw2\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard2\/dw1\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/stage2\/proj\/BatchNorm\/FusedBatchNorm:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/pt3\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/pt3\/Relu:0",
      "blob_weights" : 63,
      "K" : 48,
      "blob_biases" : 61,
      "name" : "MobileNetV3_Seg\/encodeHard2\/pt3\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 30,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/concat_1:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/dw3\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/dw3\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 67,
      "K" : 30,
      "blob_biases" : 65,
      "name" : "MobileNetV3_Seg\/encodeHard2\/dw3\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 30,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 30,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/pt3\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/pt4\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/pt4\/Relu:0",
      "blob_weights" : 71,
      "K" : 30,
      "blob_biases" : 69,
      "name" : "MobileNetV3_Seg\/encodeHard2\/pt4\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/dw3\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/dw4\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/dw4\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 75,
      "K" : 12,
      "blob_biases" : 73,
      "name" : "MobileNetV3_Seg\/encodeHard2\/dw4\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 12,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/pt4\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/concat_2:0",
      "top" : "MobileNetV3_Seg\/encodeHard2\/concat_2:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard2\/concat_2:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/dw4\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard2\/dw3\/BatchNorm\/FusedBatchNorm:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/pt5\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/pt5\/Relu:0",
      "blob_weights" : 79,
      "K" : 42,
      "blob_biases" : 77,
      "name" : "MobileNetV3_Seg\/encodeHard2\/pt5\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/concat_2:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/dw5\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard2\/dw5\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 83,
      "K" : 20,
      "blob_biases" : 81,
      "name" : "MobileNetV3_Seg\/encodeHard2\/dw5\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 20,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 20,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/pt5\/Relu:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard2\/concat_3:0",
      "top" : "MobileNetV3_Seg\/encodeHard2\/concat_3:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard2\/concat_3:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/dw0\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard2\/dw2\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard2\/dw4\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard2\/dw5\/BatchNorm\/FusedBatchNorm:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/stage2_conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/stage2_conv\/Relu:0",
      "blob_weights" : 87,
      "K" : 56,
      "blob_biases" : 85,
      "name" : "MobileNetV3_Seg\/stage2_conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "MobileNetV3_Seg\/encodeHard2\/concat_3:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "MobileNetV3_Seg\/AvgPool2D\/AvgPool:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "MobileNetV3_Seg\/AvgPool2D\/AvgPool:0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "MobileNetV3_Seg\/AvgPool2D\/AvgPool:0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "MobileNetV3_Seg\/stage2_conv\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/pt0\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/pt0\/Relu:0",
      "blob_weights" : 91,
      "K" : 48,
      "blob_biases" : 89,
      "name" : "MobileNetV3_Seg\/encodeHard3\/pt0\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 18,
      "bottom" : "MobileNetV3_Seg\/AvgPool2D\/AvgPool:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/dw0\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/dw0\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 95,
      "K" : 18,
      "blob_biases" : 93,
      "name" : "MobileNetV3_Seg\/encodeHard3\/dw0\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 18,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 18,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/pt0\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "bottom" : "MobileNetV3_Seg\/AvgPool2D\/AvgPool:0",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "MobileNetV3_Seg\/AvgPool2D\/AvgPool:0__linear_activation",
      "top" : "MobileNetV3_Seg\/AvgPool2D\/AvgPool:0__linear_activation",
      "type" : "activation",
      "name" : "MobileNetV3_Seg\/AvgPool2D\/AvgPool:0__linear_activation",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/concat:0",
      "top" : "MobileNetV3_Seg\/encodeHard3\/concat:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard3\/concat:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/dw0\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/AvgPool2D\/AvgPool:0__linear_activation"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/pt1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/pt1\/Relu:0",
      "blob_weights" : 99,
      "K" : 66,
      "blob_biases" : 97,
      "name" : "MobileNetV3_Seg\/encodeHard3\/pt1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 28,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/concat:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/dw1\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/dw1\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 103,
      "K" : 28,
      "blob_biases" : 101,
      "name" : "MobileNetV3_Seg\/encodeHard3\/dw1\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 28,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 28,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/pt1\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/pt2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/pt2\/Relu:0",
      "blob_weights" : 107,
      "K" : 28,
      "blob_biases" : 105,
      "name" : "MobileNetV3_Seg\/encodeHard3\/pt2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 18,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/dw1\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/dw2\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/dw2\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 111,
      "K" : 18,
      "blob_biases" : 109,
      "name" : "MobileNetV3_Seg\/encodeHard3\/dw2\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 18,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 18,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/pt2\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/concat_1:0",
      "top" : "MobileNetV3_Seg\/encodeHard3\/concat_1:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard3\/concat_1:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/dw2\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard3\/dw1\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/AvgPool2D\/AvgPool:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/pt3\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/pt3\/Relu:0",
      "blob_weights" : 115,
      "K" : 94,
      "blob_biases" : 113,
      "name" : "MobileNetV3_Seg\/encodeHard3\/pt3\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 46,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/concat_1:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/dw3\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/dw3\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 119,
      "K" : 46,
      "blob_biases" : 117,
      "name" : "MobileNetV3_Seg\/encodeHard3\/dw3\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 46,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 46,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/pt3\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/pt4\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/pt4\/Relu:0",
      "blob_weights" : 123,
      "K" : 46,
      "blob_biases" : 121,
      "name" : "MobileNetV3_Seg\/encodeHard3\/pt4\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 18,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/dw3\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/dw4\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/dw4\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 127,
      "K" : 18,
      "blob_biases" : 125,
      "name" : "MobileNetV3_Seg\/encodeHard3\/dw4\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 18,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 18,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/pt4\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/concat_2:0",
      "top" : "MobileNetV3_Seg\/encodeHard3\/concat_2:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard3\/concat_2:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/dw4\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard3\/dw3\/BatchNorm\/FusedBatchNorm:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/pt5\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/pt5\/Relu:0",
      "blob_weights" : 131,
      "K" : 64,
      "blob_biases" : 129,
      "name" : "MobileNetV3_Seg\/encodeHard3\/pt5\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 28,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/concat_2:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/dw5\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/dw5\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 135,
      "K" : 28,
      "blob_biases" : 133,
      "name" : "MobileNetV3_Seg\/encodeHard3\/dw5\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 28,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 28,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/pt5\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/pt6\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/pt6\/Relu:0",
      "blob_weights" : 139,
      "K" : 28,
      "blob_biases" : 137,
      "name" : "MobileNetV3_Seg\/encodeHard3\/pt6\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 18,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/dw5\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/dw6\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/dw6\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 143,
      "K" : 18,
      "blob_biases" : 141,
      "name" : "MobileNetV3_Seg\/encodeHard3\/dw6\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 18,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 18,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/pt6\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/concat_3:0",
      "top" : "MobileNetV3_Seg\/encodeHard3\/concat_3:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard3\/concat_3:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/dw6\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard3\/dw5\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard3\/dw3\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/AvgPool2D\/AvgPool:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/pt7\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/pt7\/Relu:0",
      "blob_weights" : 147,
      "K" : 140,
      "blob_biases" : 145,
      "name" : "MobileNetV3_Seg\/encodeHard3\/pt7\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 74,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/concat_3:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/dw7\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard3\/dw7\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 151,
      "K" : 74,
      "blob_biases" : 149,
      "name" : "MobileNetV3_Seg\/encodeHard3\/dw7\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 74,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 74,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/pt7\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard3\/concat_4:0",
      "top" : "MobileNetV3_Seg\/encodeHard3\/concat_4:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard3\/concat_4:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/dw0\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard3\/dw2\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard3\/dw4\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard3\/dw6\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard3\/dw7\/BatchNorm\/FusedBatchNorm:0"
    },
    {
      "pad_r" : 0,
      "debug_info" : "MobileNetV3_Seg\/se_stage3\/Mean:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 24,
      "is_global" : 1,
      "top" : "MobileNetV3_Seg\/se_stage3\/Mean:0",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "MobileNetV3_Seg\/se_stage3\/Mean:0",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/concat_4:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 42,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/se_stage3\/squeeze\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/se_stage3\/squeeze\/Relu:0",
      "blob_weights" : 155,
      "K" : 146,
      "blob_biases" : 153,
      "name" : "MobileNetV3_Seg\/se_stage3\/squeeze\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 36,
      "bottom" : "MobileNetV3_Seg\/se_stage3\/Mean:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/se_stage3\/excite\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/se_stage3\/excite\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 159,
      "K" : 36,
      "blob_biases" : 157,
      "name" : "MobileNetV3_Seg\/se_stage3\/excite\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 146,
      "bottom" : "MobileNetV3_Seg\/se_stage3\/squeeze\/Relu:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "MobileNetV3_Seg\/se_stage3\/excite\/BatchNorm\/FusedBatchNorm:0",
      "alpha" : 3,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "MobileNetV3_Seg\/se_stage3\/excite\/add:0",
      "top" : "MobileNetV3_Seg\/se_stage3\/excite\/add:0",
      "type" : "elementwise",
      "name" : "MobileNetV3_Seg\/se_stage3\/excite\/add:0",
      "beta" : 0
    },
    {
      "bottom" : "MobileNetV3_Seg\/se_stage3\/excite\/add:0",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0",
      "top" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0",
      "type" : "activation",
      "name" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0"
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0_neg",
      "top" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "bottom" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0_neg",
      "alpha" : -6,
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0_clip",
      "top" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0",
      "top" : "MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0",
      "type" : "activation",
      "name" : "MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0",
      "beta" : 0
    },
    {
      "bottom" : "MobileNetV3_Seg\/se_stage3\/excite\/Relu6:0",
      "alpha" : 0.16666699945926666,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "MobileNetV3_Seg\/se_stage3\/excite\/mul:0",
      "top" : "MobileNetV3_Seg\/se_stage3\/excite\/mul:0",
      "type" : "elementwise",
      "name" : "MobileNetV3_Seg\/se_stage3\/excite\/mul:0",
      "beta" : 0
    },
    {
      "bottom" : "MobileNetV3_Seg\/encodeHard3\/concat_4:0,MobileNetV3_Seg\/se_stage3\/excite\/mul:0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "MobileNetV3_Seg\/se_stage3\/mul:0",
      "top" : "MobileNetV3_Seg\/se_stage3\/mul:0",
      "type" : "elementwise",
      "name" : "MobileNetV3_Seg\/se_stage3\/mul:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/stage3_conv\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/stage3_conv\/Relu:0",
      "blob_weights" : 163,
      "K" : 146,
      "blob_biases" : 161,
      "name" : "MobileNetV3_Seg\/stage3_conv\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "MobileNetV3_Seg\/se_stage3\/mul:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 2,
      "top" : "MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "MobileNetV3_Seg\/stage3_conv\/Relu:0",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 2,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/pt0\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard4\/pt0\/Relu:0",
      "blob_weights" : 167,
      "K" : 80,
      "blob_biases" : 165,
      "name" : "MobileNetV3_Seg\/encodeHard4\/pt0\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/dw0\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard4\/dw0\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 171,
      "K" : 22,
      "blob_biases" : 169,
      "name" : "MobileNetV3_Seg\/encodeHard4\/dw0\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/pt0\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "bottom" : "MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0__linear_activation",
      "top" : "MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0__linear_activation",
      "type" : "activation",
      "name" : "MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0__linear_activation",
      "beta" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/concat:0",
      "top" : "MobileNetV3_Seg\/encodeHard4\/concat:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard4\/concat:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/dw0\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0__linear_activation"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/pt1\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard4\/pt1\/Relu:0",
      "blob_weights" : 175,
      "K" : 102,
      "blob_biases" : 173,
      "name" : "MobileNetV3_Seg\/encodeHard4\/pt1\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 36,
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/concat:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/dw1\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard4\/dw1\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 179,
      "K" : 36,
      "blob_biases" : 177,
      "name" : "MobileNetV3_Seg\/encodeHard4\/dw1\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 36,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 36,
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/pt1\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/pt2\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard4\/pt2\/Relu:0",
      "blob_weights" : 183,
      "K" : 36,
      "blob_biases" : 181,
      "name" : "MobileNetV3_Seg\/encodeHard4\/pt2\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/dw1\/BatchNorm\/FusedBatchNorm:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/dw2\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard4\/dw2\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 187,
      "K" : 22,
      "blob_biases" : 185,
      "name" : "MobileNetV3_Seg\/encodeHard4\/dw2\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/pt2\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/concat_1:0",
      "top" : "MobileNetV3_Seg\/encodeHard4\/concat_1:0",
      "type" : "concat",
      "name" : "MobileNetV3_Seg\/encodeHard4\/concat_1:0",
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/dw2\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/encodeHard4\/dw1\/BatchNorm\/FusedBatchNorm:0,MobileNetV3_Seg\/AvgPool2D_1\/AvgPool:0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/pt3\/Conv2D:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard4\/pt3\/Relu:0",
      "blob_weights" : 191,
      "K" : 138,
      "blob_biases" : 189,
      "name" : "MobileNetV3_Seg\/encodeHard4\/pt3\/Conv2D:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 56,
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/concat_1:0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "MobileNetV3_Seg\/encodeHard4\/dw3\/depthwise:0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "MobileNetV3_Seg\/encodeHard4\/dw3\/BatchNorm\/FusedBatchNorm:0",
      "blob_weights" : 195,
      "K" : 56,
      "blob_biases" : 193,
      "name" : "MobileNetV3_Seg\/encodeHard4\/dw3\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 56,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 56,
      "bottom" : "MobileNetV3_Seg\/encodeHard4\/pt3\/Relu:0",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
